In [1]:
import pandas as pd

C:\Users\asus\AppData\Roaming\Python\Python311\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [2]:
pd.__version__

'2.2.3'

In [2]:
data={"Apples":[102,500,250,75],"Grapes":[50,150,90,45]}
df=pd.DataFrame(data,index=["A","B","C","D"])

In [24]:
df

   Apples  Grapes
A     102      50
B     500     150
C     250      90
D      75      45

In [10]:
df[["Grapes"]]

   Grapes
0      50
1     150
2      90
3      45

In [11]:
df['Banana']=df["Grapes"]+50

In [12]:
df

   Apples  Grapes  Banana
0     102      50     100
1     500     150     200
2     250      90     140
3      75      45      95

In [14]:
df.drop(['Banana'],axis=1,inplace=True)

In [15]:
df

   Apples  Grapes
0     102      50
1     500     150
2     250      90
3      75      45

In [3]:
df['Banana']=df["Grapes"]+50
df["Pear"]=df['Banana']+100
df['Mangoes']=df["Pear"]+ 500
df['Jackfruit']=df['Grapes']+150
df["Strawberry"]=df["Jackfruit"]+200
df["Oranges"]=df["Strawberry"]+17

# row part of DataFrame

In [4]:
df

   Apples  Grapes  Banana  Pear  Mangoes  Jackfruit  Strawberry  Oranges
A     102      50     100   200      700        200         400      417
B     500     150     200   300      800        300         500      517
C     250      90     140   240      740        240         440      457
D      75      45      95   195      695        195         395      412

Row selection

In [27]:
#loc and iloc

df.iloc[3]

Apples         75
Grapes         45
Banana         95
Pear          195
Mangoes       695
Jackfruit     195
Strawberry    395
Oranges       412
Name: D, dtype: int64

In [28]:
df.iloc[[3]]

   Apples  Grapes  Banana  Pear  Mangoes  Jackfruit  Strawberry  Oranges
D      75      45      95   195      695        195         395      412

In [29]:
df.loc[["D"]]

   Apples  Grapes  Banana  Pear  Mangoes  Jackfruit  Strawberry  Oranges
D      75      45      95   195      695        195         395      412

In [30]:
df.iloc[[-1]]

   Apples  Grapes  Banana  Pear  Mangoes  Jackfruit  Strawberry  Oranges
D      75      45      95   195      695        195         395      412

In [32]:
df.iloc[2:3]

   Apples  Grapes  Banana  Pear  Mangoes  Jackfruit  Strawberry  Oranges
C     250      90     140   240      740        240         440      457

In [34]:
df.loc['A':"D"]

   Apples  Grapes  Banana  Pear  Mangoes  Jackfruit  Strawberry  Oranges
A     102      50     100   200      700        200         400      417
B     500     150     200   300      800        300         500      517
C     250      90     140   240      740        240         440      457
D      75      45      95   195      695        195         395      412

#Row Addition

In [5]:
student_marks={"Name":["Rahul","Rohit","Venkat","Sahil","Ankita"],
               "OS":[25,75.5,96,0,100],
               "DBMS":[20,80,60,50,99]}
df1=pd.DataFrame(student_marks)

In [6]:
df1

     Name     OS  DBMS
0   Rahul   25.0    20
1   Rohit   75.5    80
2  Venkat   96.0    60
3   Sahil    0.0    50
4  Ankita  100.0    99

In [7]:
data2={"Name":["Robby"],"OS":[60.5],"DBMS":[55.5]}
df2=pd.DataFrame(data2)

In [8]:
df1=pd.concat([df1,df2])

In [9]:
df1

     Name     OS  DBMS
0   Rahul   25.0  20.0
1   Rohit   75.5  80.0
2  Venkat   96.0  60.0
3   Sahil    0.0  50.0
4  Ankita  100.0  99.0
0   Robby   60.5  55.5

In [49]:
df1.iloc[0]

Name    Rahul
OS       25.0
DBMS     20.0
Name: 0, dtype: object

In [50]:
df1.iloc[5]

Name    Robby
OS       60.5
DBMS     55.5
Name: 0, dtype: object

In [55]:
df3=pd.concat([df1,df2],ignore_index=True)

In [56]:
df3

     Name     OS  DBMS
0   Rahul   25.0  20.0
1   Rohit   75.5  80.0
2  Venkat   96.0  60.0
3   Sahil    0.0  50.0
4  Ankita  100.0  99.0
5   Robby   60.5  55.5
6   Robby   60.5  55.5

In [58]:
#2nd Method
data3={"Name":"Venan","OS":85.5,"DBMS":68}
df2=pd.DataFrame(data3,index=[0])

In [59]:
df2

    Name    OS  DBMS
0  Venan  85.5    68

In [63]:
df1=pd.concat([df1,df2],ignore_index=True)

In [64]:
df1

     Name     OS  DBMS
0   Rahul   25.0  20.0
1   Rohit   75.5  80.0
2  Venkat   96.0  60.0
3   Sahil    0.0  50.0
4  Ankita  100.0  99.0
5   Robby   60.5  55.5
6   Venan   85.5  68.0

In [66]:
#2nd Method
data3={"Name":"Spiderman","OS":95,"DBMS":88}
df2=pd.DataFrame(data3,index=[0])

In [67]:
df1=pd.concat([df1,df2])

In [68]:
df1

        Name     OS  DBMS
0      Rahul   25.0  20.0
1      Rohit   75.5  80.0
2     Venkat   96.0  60.0
3      Sahil    0.0  50.0
4     Ankita  100.0  99.0
5      Robby   60.5  55.5
6      Venan   85.5  68.0
0  Spiderman   95.0  88.0

In [69]:
df1.loc[0]

        Name    OS  DBMS
0      Rahul  25.0  20.0
0  Spiderman  95.0  88.0

In [72]:
df1.loc[[4]]=["Steve",67,23]

In [73]:
df1

        Name    OS  DBMS
0      Rahul  25.0  20.0
1      Rohit  75.5  80.0
2     Venkat  96.0  60.0
3      Sahil   0.0  50.0
4      Steve  67.0  23.0
5      Robby  60.5  55.5
6      Venan  85.5  68.0
0  Spiderman  95.0  88.0

In [74]:
df1.loc[0]=["vision",100,105]

In [75]:
df1

     Name     OS   DBMS
0  vision  100.0  105.0
1   Rohit   75.5   80.0
2  Venkat   96.0   60.0
3   Sahil    0.0   50.0
4   Steve   67.0   23.0
5   Robby   60.5   55.5
6   Venan   85.5   68.0
0  vision  100.0  105.0

In [76]:
df1.iloc[0]=["Starlord",10,9]

In [77]:
df1

       Name     OS   DBMS
0  Starlord   10.0    9.0
1     Rohit   75.5   80.0
2    Venkat   96.0   60.0
3     Sahil    0.0   50.0
4     Steve   67.0   23.0
5     Robby   60.5   55.5
6     Venan   85.5   68.0
0    vision  100.0  105.0

In [ ]:
#ERROR
df1.iloc[5]=["Hulk",10,9,78]    #-> exceed the column (must have equal len of key and value)

In [78]:
df1.iloc[3]=["Hulk",60]  # the not column (must have equal len of key and value)

ValueError: Must have equal len keys and value when setting with an iterable

# Deletion

In [80]:
#del,pop,drop
del df1.loc[[5]]

AttributeError: __delitem__

In [85]:
df1.pop().loc[[5]]

TypeError: DataFrame.pop() missing 1 required positional argument: 'item'

In [84]:
#df1.pop(df1.loc[[5]])    #Error

In [ ]:
#  df1.pop(6)    #Error

In [86]:
df1.drop(6)

       Name     OS   DBMS
0  Starlord   10.0    9.0
1     Rohit   75.5   80.0
2    Venkat   96.0   60.0
3     Sahil    0.0   50.0
4     Steve   67.0   23.0
5     Robby   60.5   55.5
0    vision  100.0  105.0

In [87]:
# for permanent change 
df1.drop(6 ,inplace=True)

In [88]:
df1

       Name     OS   DBMS
0  Starlord   10.0    9.0
1     Rohit   75.5   80.0
2    Venkat   96.0   60.0
3     Sahil    0.0   50.0
4     Steve   67.0   23.0
5     Robby   60.5   55.5
0    vision  100.0  105.0


df1.drop(6)  #error

In [92]:
df1.drop(0,inplace=True)

In [93]:
df1

     Name    OS  DBMS
1   Rohit  75.5  80.0
2  Venkat  96.0  60.0
3   Sahil   0.0  50.0
4   Steve  67.0  23.0
5   Robby  60.5  55.5

# Data Exploration

In [94]:
df

   Apples  Grapes  Banana  Pear  Mangoes  Jackfruit  Strawberry  Oranges
A     102      50     100   200      700        200         400      417
B     500     150     200   300      800        300         500      517
C     250      90     140   240      740        240         440      457
D      75      45      95   195      695        195         395      412

head()

df1 having million of data (say as Population -> super of all Sample )

In [95]:
df1.head()  #say as Sample(Subset of Population)

     Name    OS  DBMS
1   Rohit  75.5  80.0
2  Venkat  96.0  60.0
3   Sahil   0.0  50.0
4   Steve  67.0  23.0
5   Robby  60.5  55.5

tail()

In [97]:
df1.tail()

     Name    OS  DBMS
1   Rohit  75.5  80.0
2  Venkat  96.0  60.0
3   Sahil   0.0  50.0
4   Steve  67.0  23.0
5   Robby  60.5  55.5

In [98]:
df1.head(2)

     Name    OS  DBMS
1   Rohit  75.5  80.0
2  Venkat  96.0  60.0

In [99]:
df1.tail(2)

    Name    OS  DBMS
4  Steve  67.0  23.0
5  Robby  60.5  55.5

In [100]:
df1.tail(20)

     Name    OS  DBMS
1   Rohit  75.5  80.0
2  Venkat  96.0  60.0
3   Sahil   0.0  50.0
4   Steve  67.0  23.0
5   Robby  60.5  55.5

dtypes

In [102]:
df1.dtypes

Name     object
OS      float64
DBMS    float64
dtype: object

In [103]:
df1.empty

False

In [104]:
df1.ndim

2

In [105]:
df1.shape

(5, 3)

In [106]:
df1.size

15

In [107]:
df1.values

array([['Rohit', 75.5, 80.0],
       ['Venkat', 96.0, 60.0],
       ['Sahil', 0.0, 50.0],
       ['Steve', 67.0, 23.0],
       ['Robby', 60.5, 55.5]], dtype=object)

In [108]:
df1.keys

<bound method NDFrame.keys of      Name    OS  DBMS
1   Rohit  75.5  80.0
2  Venkat  96.0  60.0
3   Sahil   0.0  50.0
4   Steve  67.0  23.0
5   Robby  60.5  55.5>

In [110]:
df1.describe()

              OS       DBMS
count   5.000000   5.000000
mean   59.800000  53.700000
std    36.004514  20.559669
min     0.000000  23.000000
25%    60.500000  50.000000
50%    67.000000  55.500000
75%    75.500000  60.000000
max    96.000000  80.000000

In [10]:
df1.T  #temporay change

          0      1       2      3       4      0
Name  Rahul  Rohit  Venkat  Sahil  Ankita  Robby
OS     25.0   75.5    96.0    0.0   100.0   60.5
DBMS   20.0   80.0    60.0   50.0    99.0   55.5

In [11]:
df1.iloc[1]   # index 1 value

Name    Rohit
OS       75.5
DBMS     80.0
Name: 1, dtype: object

In [12]:
df1

     Name     OS  DBMS
0   Rahul   25.0  20.0
1   Rohit   75.5  80.0
2  Venkat   96.0  60.0
3   Sahil    0.0  50.0
4  Ankita  100.0  99.0
0   Robby   60.5  55.5

In [13]:
asd=df1.T

In [14]:
asd.iloc[1]

0     25.0
1     75.5
2     96.0
3      0.0
4    100.0
0     60.5
Name: OS, dtype: object

In [15]:
df1.sum()

Name    RahulRohitVenkatSahilAnkitaRobby
OS                                 357.0
DBMS                               364.5
dtype: object

In [16]:
df1['OS'].sum()

357.0

In [18]:
df1.sum(axis=1)

TypeError: can only concatenate str (not "float") to str

In [19]:
df1.mean()

TypeError: Could not convert ['RahulRohitVenkatSahilAnkitaRobby'] to numeric

In [21]:
#df1.mean(1)

In [22]:
df1.median()

TypeError: Cannot convert [['Rahul' 'Rohit' 'Venkat' 'Sahil' 'Ankita' 'Robby']] to numeric

In [24]:
#df1.meadian(1)

In [25]:
df1.mode()

     Name     OS  DBMS
0  Ankita    0.0  20.0
1   Rahul   25.0  50.0
2   Robby   60.5  55.5
3   Rohit   75.5  60.0
4   Sahil   96.0  80.0
5  Venkat  100.0  99.0

In [26]:
df1.mode(1)

C:\Users\asus\AppData\Local\Temp\ipykernel_12164\3078165969.py:1: UserWarning: Unable to sort modes: '<' not supported between instances of 'float' and 'str'
  df1.mode(1)

        0      1     2
0   Rahul   25.0  20.0
1   Rohit   75.5  80.0
2  Venkat   96.0  60.0
3   Sahil    0.0  50.0
4  Ankita  100.0  99.0
0   Robby   60.5  55.5

In [27]:
df1.std()

TypeError: could not convert string to float: 'Rahul'

In [33]:
df1.min()

Name    Ankita
OS         0.0
DBMS      20.0
dtype: object

In [29]:
df1

     Name     OS  DBMS
0   Rahul   25.0  20.0
1   Rohit   75.5  80.0
2  Venkat   96.0  60.0
3   Sahil    0.0  50.0
4  Ankita  100.0  99.0
0   Robby   60.5  55.5

In [34]:
df2.max()

Name    Robby
OS       60.5
DBMS     55.5
dtype: object

In [31]:
df1.min(1)

TypeError: '<=' not supported between instances of 'str' and 'float'

In [32]:
df1.max(1)

TypeError: '>=' not supported between instances of 'str' and 'float'

In [35]:
df1.cumsum()

                               Name     OS   DBMS
0                             Rahul   25.0   20.0
1                        RahulRohit  100.5  100.0
2                  RahulRohitVenkat  196.5  160.0
3             RahulRohitVenkatSahil  196.5  210.0
4       RahulRohitVenkatSahilAnkita  296.5  309.0
0  RahulRohitVenkatSahilAnkitaRobby  357.0  364.5

In [36]:
df1.cumprod()

TypeError: can't multiply sequence by non-int of type 'str'